In [1]:
import numpy as np
import pandas as pd

In [2]:
from pathlib import Path
import pandas as pd

def load_csv(path):
    try:
        return pd.read_csv(path, encoding="utf-8")
    except UnicodeDecodeError:
        return pd.read_csv(path, encoding="latin1")

DATA_PATH = Path("./hfactory_magic_folders/retail_mix_optimization")

# dim_blocks_v1

In [36]:
df_blocks = load_csv(DATA_PATH / "dim_blocks_v1.csv")

In [37]:
df_blocks[df_blocks.duplicated('block_id', keep=False)]

,mall_id,block_id,block_type,store_code,store_name,retailer_code,bl1_label,bl2_label,bl3_label,gla,gla_category
24,26,6440,CELL,1313602,NaN,139380,Home,Pets,Pet shops & pet supplies,150.15,SMALL UNITS
27,7,20,CELL,600058,PRINTEMPS,4534,Department Stores,Department Stores,Department Stores,16574.00,LARGE UNITS
50,33,6774,CELL,1300870,NaN,461,Services,Multiservices shops,Multiservices shops,NaN,NaN
52,25,6177,CELL,1061963,NaN,867,Health & Beauty,Pharmacy,Pharmacy,217.99,SMALL UNITS
60,13,7686,CELL,1302731,NaN,91665,Services,Multiservices shops,Multiservices shops,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
4096,28,5670,CELL,1076117,NaN,458,Fashion apparel,Women's Fashion,Women's Fashion,238.00,SMALL UNITS
4099,32,11425,CELL,1313477,NaN,111271,Fashion apparel,Women's Fashion,Women's Fashion,115.15,SMALL UNITS
4110,33,6869,CELL,1108109,NaN,90343,Fashion apparel,Women's Fashion,Women's Fashion,87.20,SMALL UNITS
4116,33,6920,CELL,1024707,NaN,24400,Fashion apparel,Women's Fashion,Women's Fashion,111.00,SMALL UNITS
4135,23,5914,CELL,1048271,NaN,623,Fashion apparel,Women's Fashion,Women's Fashion,605.00,MSU

In [41]:
# drop the duplicates(keep the ones with not-non gla info)
sorted_df = df_blocks.sort_values(
    by=['block_id'] + ["gla"],
    ascending=[True, False],
    na_position="last" 
)

df_blocks = sorted_df.drop_duplicates(subset='block_id', keep="first")

In [42]:
df_blocks.shape
df_blocks.info()
df_blocks.isna().mean().sort_values(ascending=False)

<class 'pandas.core.frame.DataFrame'>
Index: 3854 entries, 486 to 4012
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   mall_id        3854 non-null   int64
 1   block_id       3854 non-null   int64
 2   block_type     3854 non-null   object
 3   store_code     3854 non-null   int64
 4   store_name     454 non-null    object
 5   retailer_code  3854 non-null   int64
 6   bl1_label      3854 non-null   object
 7   bl2_label      3854 non-null   object
 8   bl3_label      3854 non-null   object
 9   gla            3784 non-null   float64
 10  gla_category   3784 non-null   object
dtypes: float64(1), int64(4), object(6)
memory usage: 361.3+ KB

store_name       0.882200
gla              0.018163
gla_category     0.018163
mall_id          0.000000
block_id         0.000000
block_type       0.000000
store_code       0.000000
retailer_code    0.000000
bl1_label        0.000000
bl2_label        0.000000
bl3_label        0.000000
dtype: float64

In [43]:
df_blocks.to_csv('df_blocks.csv')

# cross_visits_v1

In [46]:
cross_visits = load_csv(DATA_PATH / "cross_visits_v1.csv")

In [51]:
cross_visits.duplicated().sum()

0

In [54]:
cross_visits['total_cross_visits'].describe()

count    2.790570e+05
mean     1.222957e+04
std      4.026851e+04
min      1.000000e+00
25%      3.240000e+02
50%      1.680000e+03
75%      8.036000e+03
max      1.433132e+06
Name: total_cross_visits, dtype: float64

# dim_malls_v1

In [58]:
dim_malls = load_csv(DATA_PATH / "dim_malls_v1.csv")

In [61]:
dim_malls

     id country           mall_name opening_hour closing_hour
0    32      GB                 NaN     08:00:00     22:00:00
1    19      AT                 NaN     08:00:00     22:00:00
2    13      AT                 NaN     08:00:00     22:00:00
3    10      CZ                 NaN     08:00:00     22:00:00
4    36      DE                 NaN     08:00:00     22:00:00
5    24      ES                 NaN     08:00:00     22:00:00
6    26      ES                 NaN     08:00:00     22:00:00
7    25      ES                 NaN     08:00:00     22:00:00
8    15      FR   Westfield Parly 2     08:00:00     22:00:00
9     7      FR  Westfield Vélizy 2     08:00:00     22:00:00
10   16      FR                 NaN     08:00:00     22:00:00
11   14      FR                 NaN     08:00:00     22:00:00
12   22      FR           Euralille     08:00:00     22:00:00
13   27      FR                 NaN     08:00:00     22:00:00
14   12      FR                 NaN     08:00:00     22:00:00
15   17      FR                 NaN     08:00:00     22:00:00
16  164      FR                 NaN     08:00:00     22:00:00
17   18      NL                 NaN     08:00:00     22:00:00
18   30      PL                 NaN     08:00:00     22:00:00
19   33      PL                 NaN     08:00:00     22:00:00
20   23      SE                 NaN     08:00:00     22:00:00
21   28      SE                 NaN     08:00:00     22:00:00

In [62]:
print(dim_malls['opening_hour'].unique())
print(dim_malls['closing_hour'].unique())

['08:00:00']
['22:00:00']

# fact_malls_v1.csv

In [73]:
fact_malls = load_csv(DATA_PATH / "fact_malls_v1.csv")

In [74]:
fact_malls.shape
fact_malls.info()
fact_malls.isna().mean().sort_values(ascending=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7135 entries, 0 to 7134
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date                7135 non-null   object
 1   mall_id             7135 non-null   int64
 2   people_in           7123 non-null   float64
 3   average_dwell_time  7113 non-null   float64
 4   dwell_time_sample   7118 non-null   float64
 5   median_dwell_time   7118 non-null   float64
dtypes: float64(4), int64(1), object(1)
memory usage: 334.6+ KB

average_dwell_time    0.003083
dwell_time_sample     0.002383
median_dwell_time     0.002383
people_in             0.001682
date                  0.000000
mall_id               0.000000
dtype: float64

In [75]:
fact_malls['date'] = pd.to_datetime(fact_malls['date'])

/tmp/ipykernel_802/203262828.py:1: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  fact_malls['date'] = pd.to_datetime(fact_malls['date'])

In [76]:
fact_malls.duplicated(["date", "mall_id"]).mean()

0.0

In [77]:
# make sure the columns all make sense
fact_malls[fact_malls["people_in"] <= 0]

,date,mall_id,people_in,average_dwell_time,dwell_time_sample,median_dwell_time
5497,2025-01-01,36,0.0,NaN,0.0,0.0

In [78]:
fact_malls.describe()

,date,mall_id,people_in,average_dwell_time,dwell_time_sample,median_dwell_time
count,7135,7135.000000,7123.000000,7113.000000,7118.000000,7118.000000
mean,2025-01-03 05:59:02.480729088,20.821584,54467.492349,68.109378,17508.610565,47.346892
min,2024-07-01 00:00:00,7.000000,0.000000,0.000000,0.000000,0.000000
25%,2024-10-07 00:00:00,14.000000,30541.000000,60.875107,11042.000000,40.235400
50%,2025-01-04 00:00:00,19.000000,41293.000000,69.105498,15273.000000,47.116700
75%,2025-04-03 00:00:00,26.000000,60960.500000,77.902387,20366.500000,54.762525
max,2025-07-01 00:00:00,36.000000,421773.000000,122.086570,96801.000000,125.983000
std,NaN,7.896264,42365.889647,16.128046,11149.373958,14.431217

# fact_sri_scores_v1

In [79]:
fact_sri_scores = load_csv(DATA_PATH / "fact_sri_scores_v1.csv")

In [90]:
fact_sri_scores[fact_sri_scores.duplicated('store_code ', keep=False)]

Empty DataFrame
Columns: [store_code , sri_score]
Index: []

In [91]:
fact_sri_scores

      store_code   sri_score
0         1053900       12.8
1         1312625       11.3
2         1313830       14.0
3         1313399        7.5
4         1100033       17.3
...           ...        ...
2120      1014247        9.0
2121      1309744       55.7
2122      1307744       14.3
2123      1078566       48.8
2124       600058        9.0

[2125 rows x 2 columns]

# fact_stores_v1

In [93]:
fact_stores = load_csv(DATA_PATH / "fact_stores_v1.csv")

In [98]:
fact_stores[fact_stores.duplicated(subset=["date", "block_id"], keep = False)]

Empty DataFrame
Columns: [date, mall_id, block_id, store_code, retailer_id, people_in, people_window_flow, store_average_dwell_time, store_median_dwell_time, shopping_average_dwell_time, average_visited_stores]
Index: []

In [99]:
fact_stores.describe()

,mall_id,block_id,store_code,retailer_id,people_in,people_window_flow,store_average_dwell_time,store_median_dwell_time,shopping_average_dwell_time,average_visited_stores
count,1.040045e+06,1.040045e+06,1.040045e+06,1.035092e+06,1.040045e+06,1.040045e+06,943175.000000,943175.000000,943175.000000,943175.000000
mean,2.057132e+01,5.707652e+03,1.099132e+06,3.798175e+04,9.028836e+02,1.661324e+04,11.517025,9.063982,94.751981,3.541058
std,8.075945e+00,3.331130e+03,2.799909e+05,4.743815e+04,1.776342e+03,1.778517e+04,13.702936,13.169039,29.579701,0.841420
min,7.000000e+00,2.000000e+00,4.200000e+01,8.000000e+00,1.600000e+01,0.000000e+00,0.000000,0.000000,0.000000,1.066504
25%,1.400000e+01,4.114000e+03,1.066591e+06,5.230000e+02,1.340000e+02,5.117000e+03,3.923435,2.622694,78.380500,2.972649
50%,1.900000e+01,5.907000e+03,1.099313e+06,8.636000e+03,3.500000e+02,1.117400e+04,5.929704,4.058311,90.983481,3.409588
75%,2.800000e+01,7.145000e+03,1.306508e+06,8.131500e+04,9.030000e+02,2.192600e+04,12.409809,8.105950,106.640739,3.980063
max,3.600000e+01,1.680900e+04,1.314592e+06,1.439110e+05,5.464600e+04,3.412090e+05,618.824392,559.167000,662.717000,34.000000

In [102]:
fact_stores[fact_stores['people_window_flow'] < 0]

Empty DataFrame
Columns: [date, mall_id, block_id, store_code, retailer_id, people_in, people_window_flow, store_average_dwell_time, store_median_dwell_time, shopping_average_dwell_time, average_visited_stores]
Index: []

# store_financials_v1

In [103]:
store_financials = load_csv(DATA_PATH / "store_financials_v1.csv")

In [105]:
store_financials.shape
store_financials.info()
store_financials.isna().mean().sort_values(ascending=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12095 entries, 0 to 12094
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   codstr            12095 non-null  int64
 1   cur_code          12095 non-null  object
 2   sales_r12m        12095 non-null  object
 3   total_costs_r12m  8412 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 378.1+ KB

total_costs_r12m    0.304506
codstr              0.000000
cur_code            0.000000
sales_r12m          0.000000
dtype: float64

In [110]:
# check for duplicates
store_financials[store_financials.duplicated('codstr', keep= False)]

Empty DataFrame
Columns: [codstr, cur_code, sales_r12m, total_costs_r12m]
Index: []

In [112]:
# negative costs found
store_financials[store_financials['total_costs_r12m'] < 0]

        codstr cur_code  sales_r12m  total_costs_r12m
1602   1046341      EUR   69759.696     -25464.525500
7168   1210464      USD  103511.512      -7722.982813
7826   1303560      USD   41625.216       -221.892138
8839   1307910      EUR    26259.79      -5587.448940
8891   1308088      EUR    31053.36      -1311.312800
10194  1311592      USD  615115.449     -19252.035850
10537  1312180      USD  246201.775      -9684.207232
10596  1312254      USD    55275.48     -66479.225980

In [113]:
# Mark tenants who have received the rent incentive
store_financials['is_subsidized'] = (store_financials['total_costs_r12m'] < 0).astype(int)

In [116]:
# unite the currency
store_financials['cur_code'].value_counts()

cur_code
EUR    6836
USD    2688
PLN     732
GBP     670
CZK     560
SEK     513
DKK      96
Name: count, dtype: int64

In [118]:
exchange_rates_to_eur = {
    'EUR': 1.0,        
    'USD': 1.0884,
    'PLN': 4.2637, 
    'GBP': 0.8406,
    'CZK': 25.112,
    'SEK': 11.2874,
    'DKK': 7.4602
}

store_financials['sales_r12m'] = pd.to_numeric(store_financials['sales_r12m'], errors='coerce')
store_financials['total_costs_r12m'] = pd.to_numeric(store_financials['total_costs_r12m'], errors='coerce')

store_financials['fx_rate'] = store_financials['cur_code'].map(exchange_rates_to_eur)
store_financials['sales_eur'] = store_financials['sales_r12m'] / store_financials['fx_rate']
store_financials['costs_eur'] = store_financials['total_costs_r12m'] / store_financials['fx_rate']

In [120]:
store_financials.to_csv('store_financials.csv')